<a href="https://colab.research.google.com/github/tsamarahanifa/LatihanProject/blob/master/18_11_2101_Praktikum11.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###### RONALD FERDINAND - 18.11.1904
## MODUL 11

## 1. MongoDB Connection
### 1.1. Pertanyaan
1. Bagaimanakah bentuk koneksi database MongoDB pada Python?

> Bentuk Koneksi MongoDB pada Python adalah diawali dengan menginstall driver MongoDB pada Python yang bernama PyMongo.

Berikut untuk menginstall-nya :

```python
pip install pymongo
```

Berikut untuk me-import librarynya :

```python 
import mongo
```
---
2. Apakah dapat melakukan ekstraksi data dari database MongoDB menggunakan Python?

> Bisa, melakukan ekstraksi data dari database MongoDB menggunakan Python dapat dilakukan dengan bantuan library. Library yang biasa digunakan untuk ekstraksi data adalah Pandas. Pada python data yang tersimpan di MongoDB dapat di ekstrak kedalam bentuk lain seperti CSV, HTML, dan JSON.

Berikut untuk menginstall-nya :
```python
pip install pandas
```

---
### 1.2. Latihan
1. Koneksikan Python pada server MongoDB lokal dengan bentuk server public !

In [ ]:
pip install pymongo

Requirement already satisfied: pymongo in d:\semestter_6\bdl\pyenv\lib\site-packages (3.11.4)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import pymongo
from bson.json_util import dumps

In [ ]:
client     = pymongo.MongoClient("mongodb://127.0.0.1:27017") #server
db         = client["db_1904"] #database
collection = db["Data001"] #collection

In [ ]:
query      = collection.find() #query
list_query = list(query)
json_data  = dumps(list_query, indent=2)
print(list_query)

[{'_id': ObjectId('606c4fc6d18384d9cbf971af'), 'namaBarang': 'Hand Sanitizer', 'warna': ['putih', 'kuning'], 'harga': 35000.0}, {'_id': ObjectId('606c5037d18384d9cbf971b0'), 'namaBarang': 'Salep Hot A', 'warna': ['biru'], 'harga': 10000.0}, {'_id': ObjectId('606c5037d18384d9cbf971b1'), 'namaBarang': 'Salep Hot B', 'harga': 15000.0}, {'_id': ObjectId('606c5037d18384d9cbf971b2'), 'namaBarang': 'Tissue Baby', 'warna': ['merah', 'Biru'], 'harga': 17500.0}]

---
2. Koneksikan Python pada server MongoDB lokal dengan bentuk server authorized

In [ ]:
from pymongo import MongoClient
client = MongoClient("mongodb://ronaldx:1904@127.0.0.1:27017")
db = client.db_1904
try: db.command("serverStatus")
except Exception as e: print(e)
else: print("You are Connected")
client.close

You are Connected

---
3. Daftarkan akun email student amikom ke cloud atlas mongoDB; buat cluster server dan koneksikan pada Python

In [ ]:
!pip install pymongo[srv]

Requirement already satisfied: pymongo[srv] in d:\semestter_6\bdl\pyenv\lib\site-packages (3.11.4)
Requirement already satisfied: dnspython<2.0.0,>=1.16.0 in d:\semestter_6\bdl\pyenv\lib\site-packages (from pymongo[srv]) (1.16.0)

In [ ]:
!pip install dnspython

Requirement already satisfied: dnspython in d:\semestter_6\bdl\pyenv\lib\site-packages (1.16.0)

In [ ]:
from pymongo import MongoClient
client = MongoClient(
    "mongodb://ronald:ronald1@cluster0-shard-00-00.rvnml.mongodb.net:27017,cluster0-shard-00-01.rvnml.mongodb.net:27017,cluster0-shard-00-02.rvnml.mongodb.net:27017/myFirstDatabase?ssl=true&replicaSet=atlas-medgi6-shard-0&authSource=admin&retryWrites=true&w=majority")

In [ ]:
db = client.test
col = db.test

data1 = {"_id": "96", "nama": "Rita"}

col.insert_one(data1)

In [ ]:
results = col.find({})

for i in results:
    print(i)

{'_id': '98', 'nama': 'Budi'}
{'_id': '97', 'nama': 'Susi'}
{'_id': '96', 'nama': 'Rita'}

---
## KESIMPULAN
- **Pymongo** berfungsi untuk menghubungkan python dengan MongoDB, dapat di install dengan perintah 
```python 
pip install pymongo
```
- Untuk menggunakan pymongo sendiri kita perlu mengimport pymongo itu sendiri dengan perintah 
```python
import pymongo
```
- Library yang paling sering digunakan didalam pymongo adalah "MongoClient", MongoClient sendiri digunakan untuk menghubungkan server lokal database dengan authorized server

---
## 2. Data Mining
### 2.1. Pertanyaan
1. Apakah yang dimaksud data mining?

> Data mining adalah proses untuk mempelajari data yang berjumlah besar untuk menemukan pola-pola dan informasi dari data tersebut. Pengumpulan data tersebut melalui beberapa proses yang meliputi metode statistika, matematika dan teknologi kecerdasan artifisial.

---
2. Bagaimanakah model data mining?

>Terdapat 2 model data mining, sebagai berikut :
- **Predictive Model**, Mengumpulkan data untuk diolah hingga melahirkan pola informasi berupa nilai prediksi. Yang termasuk model ini adalah Classification, Regression, Time-Series Analysis, dan Prediction.
- **Descriptive Model**, Mengumpulkan data untuk mempelajari bentuk hubungan atau pola dari sekumpulan data yang ada. Yang termasuk model ini adalah Clustering, Summarization, Association Rules, dan Sequence Discovery.

---
3. Bagaimanakah tahapan data mining?

>Terdapat 4 tahapan dalam Data Mining, sebagai berikut :
- **Data Cleaning,**
- **Data Integration,**
- **Data Reduction,**
- **Data Transformation.**

---
### 2.2. Latihan
1. Berikan contoh suatu nilai yang bersifat Incomplete, Noisy, Inconsistent, dan Duplicate

In [ ]:
myData = {'id':['001', '001', '002', '003', '004','005'], 'harga':[25000, 25000, 30000.98, float("NaN"), '3jt', 25000]}
myData

{'id': ['001', '001', '002', '003', '004', '005'],
 'harga': [25000, 25000, 30000.98, nan, '3jt', 25000]}

In [ ]:
!pip install pandas
!pip install numpy
import pandas as pd
import numpy as np

Requirement already satisfied: pandas in d:\semestter_6\bdl\pyenv\lib\site-packages (1.3.0)
Requirement already satisfied: numpy>=1.17.3 in d:\semestter_6\bdl\pyenv\lib\site-packages (from pandas) (1.21.0)
Requirement already satisfied: pytz>=2017.3 in d:\semestter_6\bdl\pyenv\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in d:\semestter_6\bdl\pyenv\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in d:\semestter_6\bdl\pyenv\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Requirement already satisfied: numpy in d:\semestter_6\bdl\pyenv\lib\site-packages (1.21.0)

In [ ]:
myData_df = pd.DataFrame(myData)
myData_df

Mengecek data incomplete

In [ ]:
myData_df.isna().sum()

>Ada satu data yang incomplete di field harga

Mengecek data duplikat

In [ ]:
myData_df.duplicated(subset=None, keep='first')

---
2. Bagaimana cara untuk memperbaiki data missing?

>Dengan membuang baris data yang salah satu kolomnya hilang (missing)

In [ ]:
Data2 = {'id':['001', '001', '002', '003', '004','005'], 'harga':[25000, 25000, 30000.98, float("NaN"), '3jt', 25000]}
Data2

In [ ]:
import pandas as pd
import numpy as np

df2 = pd.DataFrame(Data2)
df2

>Data pada baris ke empat atau pada index nomor 3 bernilai nan atau kosong/hilang/missing

In [ ]:
df2.dropna(inplace=True)
df2

---
## KESIMPULAN
**Data cleansing** adalah langkah pertama dalam data mining, untuk mempersiapkan dataset yang akan digunakan dalam Data Mining. Dalam persiapan data tersebut, terjadi proses mendeteksi, memperbaiki hingga menghapus data data tertentu yang dianggap Incomplete, Duplicate, Noisy, dan Incosistent.

Pada materi ini juga, kita menggunakan library pandas dan numpy untuk melakukan data ekstraksi, data framing dan pemrosesan data agar menjadi bersih tanpa adanya data yang noisy, data yang duplikat, data yang kosong, dan data yang tidak konsisten dengan data di baris yang lain.

---
## 3. PANDAS
### 3.1. Pertanyaan
1. Apakah fungsi library pandas pada data mining?
>Library Pandas pada data mining digunakan untuk melakukan manipulasi data karena memiliki bentuk struktur data yang cepat, fleksibel, dan ekspresif.

2. Bagaimanakah bentuk query library pandas pada data mining?
>Untuk import library
```python 
import pandas as pd
```
>Untuk pembuatan data frame
```python
dataframe = pandas.DataFrame(data)
```
>Untuk Import Data
```python
pd.read_csv(filename) #From a CSV file
pd.read_table(filename) #From a delimited text file (like TSV)
pd.read_excel(filename) #From an Excel file
pd.read_sql(query, connection_object) # Read from a SQL table/database
pd.read_json(json_string) # Read from a JSON formatted string, URL or file.
pd.DataFrame(dict) # From a dict, keys for columns names, values for data as lists
```
>Untuk Export Data
```python
pd.to_csv(filename) # Write to a CSV file
pd.to_excel(filename) # Write to an Excel file
pd.to_sql(table_name, connection_object) # Write to a SQL table
pd.to_json(filename) # Write to a file in JSON format
```
>Untuk Inspecting
```python
df.head(n) # First n rows of the DataFrame
df.tail(n) # Last n rows of the DataFrame
df.shape # Number of rows and columns
df.apply(pd.Series.value_counts) # Unique values and counts for all columns
```
>Untuk Cleansing Data
```python
pd.isnull() # Checks for null Values, Returns Boolean Arrray
pd.notnull() # Kebalikan dari pd.isnull()
pd.dropna() # Drop all rows that contain null values
pd.fillna(x) # Replace all null values with x
pd.astype(float) # Convert the datatype of the series to float
pd.replace(1,'one') # Replace all values equal to 1 with 'one’
```

---
### 3.2. Latihan

In [ ]:
import pymongo as pym
import pandas as pd
from bson.json_util import dumps

In [ ]:
client = pym.MongoClient("mongodb://127.0.0.1:27017/")
db = client["titanic"]
coll = db["passengers"]

cursor = coll.find()
result_cursor = list(cursor)

df = pd.DataFrame(result_cursor)
df

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
0,60d04ebfdb8077b4ebc9865f,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,NaN
1,60d04ebfdb8077b4ebc98660,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,C85
2,60d04ebfdb8077b4ebc98661,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,S,NaN
3,60d04ebfdb8077b4ebc98662,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,S,C123
4,60d04ebfdb8077b4ebc98663,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,60d04ebfdb8077b4ebc989d5,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,S,NaN
887,60d04ebfdb8077b4ebc989d6,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,S,B42
888,60d04ebfdb8077b4ebc989d7,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,S,NaN
889,60d04ebfdb8077b4ebc989d8,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C,C148
890,60d04ebfdb8077b4ebc989d9,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,Q,NaN

---
1. Tampilkan statistik data per atribut untuk data yang kosong/null !

In [ ]:
data_hilang = df.isnull().any(axis=1) 
data_hilang.sum()

708

In [ ]:
df[data_hilang]

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
0,60d04ebfdb8077b4ebc9865f,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,NaN
2,60d04ebfdb8077b4ebc98661,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,S,NaN
4,60d04ebfdb8077b4ebc98663,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,NaN
5,60d04ebfdb8077b4ebc98664,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q,NaN
7,60d04ebfdb8077b4ebc98666,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.075,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,60d04ebfdb8077b4ebc989d3,885,0,3,"Sutehall, Mr. Henry Jr",male,25,0,0,SOTON/OQ 392076,7.05,S,NaN
885,60d04ebfdb8077b4ebc989d4,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.125,Q,NaN
886,60d04ebfdb8077b4ebc989d5,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,S,NaN
888,60d04ebfdb8077b4ebc989d7,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,S,NaN
890,60d04ebfdb8077b4ebc989d9,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,Q,NaN

---
2. Tampilkan statistik data per atribut untuk maksimal data !

In [ ]:
df.dtypes

_id            object
PassengerId    object
Survived       object
Pclass         object
Name           object
Sex            object
Age            object
SibSp          object
Parch          object
Ticket         object
Fare           object
Embarked       object
Cabin          object
dtype: object

In [ ]:
df_atribut = df.astype('category')

df_atribut = df_atribut.astype('str')

df_atribut.max()

_id               60d04ebfdb8077b4ebc989d9
PassengerId                             99
Survived                                 1
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
Age                                    nan
SibSp                                    8
Parch                                    6
Ticket                           WE/P 5735
Fare                                  93.5
Embarked                               nan
Cabin                                  nan
dtype: object

---
3. Tampilkan statistik data per atribut untuk minimal data !

In [ ]:
df_atribut.min()

_id            60d04ebfdb8077b4ebc9865f
PassengerId                           1
Survived                              0
Pclass                                1
Name                Abbing, Mr. Anthony
Sex                              female
Age                                0.42
SibSp                                 0
Parch                                 0
Ticket                           110152
Fare                                  0
Embarked                              C
Cabin                               A10
dtype: object

---
4. Tampilkan umur maksimal pada dataset !

In [ ]:
df_umur = df['Age'].astype('category')
df_umur = df_umur.astype("float")
df_umur.max()

80.0

---
5. Tampilkan umur minimal pada dataset !

In [ ]:
df_umur.min()

0.42

---
6. Tampilkan total data dengan umur diatas 18 tahun !

In [ ]:
df[df_umur>18]

,_id,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin
0,60d04ebfdb8077b4ebc9865f,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,S,NaN
1,60d04ebfdb8077b4ebc98660,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,C85
2,60d04ebfdb8077b4ebc98661,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,S,NaN
3,60d04ebfdb8077b4ebc98662,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,S,C123
4,60d04ebfdb8077b4ebc98663,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,60d04ebfdb8077b4ebc989d4,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39,0,5,382652,29.125,Q,NaN
886,60d04ebfdb8077b4ebc989d5,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,S,NaN
887,60d04ebfdb8077b4ebc989d6,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,S,B42
889,60d04ebfdb8077b4ebc989d8,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C,C148
890,60d04ebfdb8077b4ebc989d9,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.75,Q,NaN

---
## KESIMPULAN
- **Pandas** adalah library python yang sangat fundamental dan sering digunakan, karena pada dasarnya library satu ini punya fungsi untuk melakukan perubahan terhadap data yang kita miliki. Pandas sendiri biasanya digunakan untuk membuat data frame, mengubah data dan tipe datanya, dan untuk melakukan pengecekan terhadap data itu sendiri.
- Setiap library python termasuk Pandas dapat di install dengan mudah menggunakan perintah 
```python 
pip install pandas
```